
import { typeList } from "./data"
// 为了展示美观 小窗口不展示 label太多细节
export const pickTypeList = () :any[] => {
  if (window.innerWidth > 1200) return typeList;
  const a = typeList.filter((v) => {
    return !(v.value == 're' || v.value == 'ra');
  });
  return a;
}

// 获取类型描述
export const getTypePlaceholder = (type :string) :string | undefined => {
  return typeList.find(item => item.value === type)?.placeholder;
}

const DEFAULT_TYPE = 'temperature-convert:default-type';

// 获取默认类型
export function getDefaultType() :string  {
    const type = localStorage.getItem(DEFAULT_TYPE);
    return (type === null)? "c" : type;
}

// 设置默认类型
export function setDefaultType(type: string) : void  {
    localStorage.setItem(DEFAULT_TYPE,type);
}

// [°F] = [°C] × 9⁄5 + 32
export const c2f = (f :number) :number => {
  return f * 9 / 5 + 32;
}

// [°C] = ([°F] − 32) × 5⁄9
export const f2c = (c :number) :number => {
  return ( c - 32 ) * 5 / 9;
}

// [K] = [°C] + 273.15
export const c2k = (c :number) :number => {
  return c + 273.15;
}

// [°C] = [K] − 273.15
export const k2c = (k :number) :number => {
  return k - 273.15;
}

// [R] = ([°C] + 273.15) × 9⁄5
export const c2r = (c :number) :number => {
  return (c + 273.15) * 9 /5;
}

// [°C] = ([R] − 491.67) × 5⁄9
export const r2c = (r :number) :number => {
  return (r - 491.67) * 5 / 9;
}

// [°De] = (100 − [°C]) × 3⁄2
export const c2d = (c :number) :number => {
  return ( 100 - c) * 3 / 2;
}

// [°C] = 100 − [°De] × 2⁄3
export const d2c = (d :number) :number => {
  return 100 - d * 2 / 3
}

// [°N] = [°C] × 33⁄100
export const c2n = (c :number) :number => {
  return c * 33 / 100;
}

// [°C] = [°N] × 100⁄33
export const n2c = (n :number) :number => {
  return n * 100 / 33;
}

// [°Ré] = [°C] × 4⁄5
export const c2Re = (c :number) :number => {
  return c * 4 / 5;
}

// [°C] = [°Ré] × 5⁄4
export const re2c = (re :number) :number => {
  return re * 5 / 4;
}

// [°Rø] = [°C] × 21⁄40 + 7.5
export const c2Ra = (c :number) :number => {
  return c * 21 / 40 + 7.5;
}

// [°C] = ([°Rø] − 7.5) × 40⁄21
export const ra2c = (ra :number) :number => {
  return (ra - 7.5) * 40 / 21
}

/**
            从摄氏温标换算至其他温度单位	从其他温度单位换算至摄氏温标
华氏温标	  [°F] = [°C] × 9⁄5 + 32	        [°C] = ([°F] − 32) × 5⁄9
凯氏温标	  [K] = [°C] + 273.15	            [°C] = [K] − 273.15
兰金温标	  [R] = ([°C] + 273.15) × 9⁄5	    [°C] = ([R] − 491.67) × 5⁄9
德利尔温标	[°De] = (100 − [°C]) × 3⁄2	    [°C] = 100 − [°De] × 2⁄3
牛顿温标	  [°N] = [°C] × 33⁄100	          [°C] = [°N] × 100⁄33
列氏温标	  [°Ré] = [°C] × 4⁄5	            [°C] = [°Ré] × 5⁄4
罗氏温标	  [°Rø] = [°C] × 21⁄40 + 7.5  	  [°C] = ([°Rø] − 7.5) × 40⁄21


            从华氏温标换算至其他温度单位	    从其他温度单位换算至华氏温标
摄氏温标	  [°C] = ([°F] − 32) × 5⁄9    	      [°F] = [°C] × 9⁄5 + 32
凯氏温标	  [K] = ([°F] + 459.67) × 5⁄9	        [°F] = [K] × 9⁄5 − 459.67
兰金温标	  [R] = [°F] + 459.67	                [°F] = [R] − 459.67
德利尔温标	[°De] = (212 − [°F]) × 5⁄6	        [°F] = 212 − [°De] × 6⁄5
牛顿温标	  [°N] = ([°F] − 32) × 11⁄60  	      [°F] = [°N] × 60⁄11 + 32
列氏温标	  [°Ré] = ([°F] − 32) × 4⁄9   	      [°F] = [°Ré] × 9⁄4 + 32
罗氏温标	  [°Rø] = ([°F] − 32) × 7⁄24 + 7.5	  [°F] = ([°Rø] − 7.5) × 24⁄7 + 32


            从凯氏温标换算至其他温度单位	        从其他温度单位换算至凯氏温标
摄氏温标	  [°C] = [K] − 273.15	                    [K] = [°C] + 273.15
华氏温标	  [°F] = [K] × 9⁄5 − 459.67	              [K] = ([°F] + 459.67) × 5⁄9
兰金温标	  [R] = [K] × 9⁄5	                        [K] = [R] × 5⁄9
德利尔温标	[°De] = (373.15 − [K]) × 3⁄2	          [K] = 373.15 − [°De] × 2⁄3
牛顿温标	  [°De] = ([K] − 273.15) × 33⁄100	        [K] = 273.15 + [°N] × 100⁄33
列氏温标	  [°Ré] = ([K] − 273.15) × 4⁄5	          [K] = [°Ré] × 5⁄4 + 273.15
罗氏温标	  [°Rø] = ([K] − 273.15) × 21⁄40 + 7.5	  [K] = ([°Rø] − 7.5) × 40⁄21 + 273.15


            从兰金温标换算至其他温度单位	        从其他温度单位换算至兰金温标
摄氏温标	  [°C] = ([R] − 491.67) × 5⁄9	            [R] = ([°C] + 273.15) × 9⁄5
华氏温标	  [°F] = [R] − 459.67	                    [R] = [°F] + 459.67
凯氏温标	  [K] = [R] × 5⁄9	                        [R] = [K] × 9⁄5
德利尔温标	[°De] = (671.67 − [°R]) × 5⁄6	          [°R] = 671.67 − [°De] × 6⁄5
牛顿温标	  [°N] = ([°R] − 491.67) × 11⁄60	        [°R] = [°N] × 60⁄11 + 491.67
列氏温标	  [°Ré] = ([°R] − 491.67) × 4⁄9	          [°R] = [°Ré] × 9⁄4 + 491.67
罗氏温标	  [°Rø] = ([°R] − 491.67) × 7⁄24 + 7.5	  [°R] = ([°Rø] − 7.5) × 24⁄7 + 491.67

            从德利尔温标换算至其他温度单位	        从其他温度单位换算至德利尔温标
摄氏温标	[°C] = 100 − [°De] × 2⁄3	              [°De] = (100 − [°C]) × 3⁄2
华氏温标	[°F] = 212 − [°De] × 6⁄5	              [°De] = (212 − [°F]) × 5⁄6
凯氏温标	[K] = 373.15 − [°De] × 2⁄3	            [°De] = (373.15 − [K]) × 3⁄2
兰金温标	[°R] = 671.67 − [°De] × 6⁄5	            [°De] = (671.67 − [°R]) × 5⁄6
牛顿温标	[°N] = 33 − [°De] × 11⁄50	              [°De] = (33 − [°N]) × 50⁄11
列氏温标	[°Ré] = 80 − [°De] × 8⁄15	              [°De] = (80 − [°Ré]) × 15⁄8
罗氏温标	[°Rø] = 60 − [°De] × 7⁄20	              [°De] = (60 − [°Rø]) × 20⁄7

            从牛顿温标换算至其他温度单位	        从其他温度单位换算至牛顿温标
摄氏温标	  [°C] = [°N] × 100⁄33	                [°N] = [°C] × 33⁄100
华氏温标	  [°F] = [°N] × 60⁄11 + 32	            [°N] = ([°F] − 32) × 11⁄60
凯氏温标	  [K] = 273.15 + [°N] × 100⁄33	        [°De] = ([K] − 273.15) × 33⁄100
兰金温标	  [°R] = [°N] × 60⁄11 + 491.67	        [°N] = ([°R] − 491.67) × 11⁄60
德利尔温标	[°De] = (33 − [°N]) × 50⁄11	          [°N] = 33 − [°De] × 11⁄50
列氏温标	  [°Ré] = [°N] × 80⁄33	                [°N] = [°Ré] × 33⁄80
罗氏温标	  [°Rø] = [°N] × 35⁄22 + 7.5          	[°N] = ([°Rø] − 7.5) × 22⁄35

            从列氏温标换算至其他温度单位	        从其他温度单位换算至列氏温标
摄氏温标	  [°C] = [°Ré] × 5⁄4	                    [°Ré] = [°C] × 4⁄5
华氏温标	  [°F] = [°Ré] × 9⁄4 + 32	                [°Ré] = ([°F] − 32) × 4⁄9
凯氏温标	  [K] = [°Ré] × 5⁄4 + 273.15	            [°Ré] = ([K] − 273.15) × 4⁄5
兰金温标	  [°R] = [°Ré] × 9⁄4 + 491.67	            [°Ré] = ([°R] − 491.67) × 4⁄9
德利尔温标	[°De] = (80 − [°Ré]) × 15⁄8	            [°Ré] = 80 − [°De] × 8⁄15
牛顿温标	  [°N] = [°Ré] × 33⁄80	                [°Ré] = [°N] × 80⁄33
罗氏温标	  [°Rø] = [°Ré] × 21⁄32 + 7.5	            [°Ré] = ([°Rø] − 7.5) × 32⁄21

            从罗氏温标换算至其他温度单位	        从其他温度单位换算至罗氏温标
摄氏温标	  [°C] = ([°Rø] − 7.5) × 40⁄21	          [°Rø] = [°C] × 21⁄40 + 7.5
华氏温标	  [°F] = ([°Rø] − 7.5) × 24⁄7 + 32	      [°Rø] = ([°F] − 32) × 7⁄24 + 7.5
凯氏温标	  [K] = ([°Rø] − 7.5) × 40⁄21 + 273.15	  [°Rø] = ([K] − 273.15) × 21⁄40 + 7.5
兰金温标	  [°R] = ([°Rø] − 7.5) × 24⁄7 + 491.67	  [°Rø] = ([°R] − 491.67) × 7⁄24 + 7.5
德利尔温标	[°De] = (60 − [°Rø]) × 20⁄7	            [°Rø] = 60 − [°De] × 7⁄20
牛顿温标	  [°N] = ([°Rø] − 7.5) × 22⁄35	          [°Rø] = [°N] × 35⁄22 + 7.5
列氏温标	  [°Ré] = ([°Rø] − 7.5) × 32⁄21	          [°Rø] = [°Ré] × 21⁄32 + 7.5
 */

